import { Helmet } from "react-helmet"
import "../styles.css"

function Schedule() {
  return (
    <div className="schedule-container">
      <Helmet>
        <title>График - Ученически Обектив</title>
        <meta name="description" content="График и информация за фестивала Ученически Обектив." />
      </Helmet>

      <h1 className="schedule-title">График и Информация</h1>

      <div className="bordered-section">
        <h2>1. Цели на фестивала</h2>
        <ul>
          <li>Насърчаване на креативността и работата в екип между ученици и учители.</li>
          <li>Развитие на уменията за създаване на филмово съдържание.</li>
          <li>
            Повишаване на интереса към изкуството и използването на различни софтуери, техника и свободно
            разпространявани музика, снимков и видео материал.
          </li>
          <li>Вярата в собствените неограничени възможности – всеки има главна роля в една филмова продукция.</li>
        </ul>
      </div>

      <div className="bordered-section">
        <h2>2. Период на провеждане</h2>
        <table className="schedule-table">
          <tbody>
            <tr>
              <td>Създаване на филмите:</td>
              <td>през учебната 2024-2025 година</td>
            </tr>
            <tr>
              <td>Краен срок за изпращане на филмите:</td>
              <td>30 април 2025 г. – ОНЛАЙН във формуляра за регистрация</td>
            </tr>
            <tr>
              <td>Оценяване:</td>
              <td>м. май 2025 - ОНЛАЙН</td>
            </tr>
            <tr>
              <td>Официално награждаване:</td>
              <td>средата на юни 2025 г. в гр. София (мястото ще се уточни допълнително)</td>
            </tr>
          </tbody>
        </table>
      </div>

      <div className="bordered-section">
        <h2>3. Изисквания към участниците</h2>
        <div className="requirements-content">
          <p>Участие в една от изброените категории:</p>
          <ul className="categories-list">
            <li>A. Документален филм</li>
            <li>B. Игрален филм</li>
            <li>C. Анимационен филм</li>
          </ul>
          <ul className="requirements-list">
            <li>Ученици от 8 до 12 клас, в екип с учител(и)</li>
            <li>Допуска се участие на ученически екип от ученици от различни училища</li>
            <li>Допуска се участие на ученически екип и без учител, но трябва да се посочи продуцента на филма</li>
            <li>При реализирането на филма не се допуска използване на AI</li>
            <li>Продължителност на филмите: от 5 до 20 минути с включени текстове за начало и край</li>
          </ul>
        </div>
      </div>

      <div className="bordered-section">
        <h2>4. Жури</h2>
        <p>Професионалисти от:</p>
        <ul>
          <li>БНТ</li>
          <li>НБУ</li>
        </ul>
      </div>
    </div>
  )
}

export default Schedule

